app/controllers/master/organizations_controller.rb

SELECT * FROM `organizations`
---
  def index
    @organizations = Organization.all

SELECT * FROM `organizations` WHERE (`organizations`.`id` = 26)
---
  def find_organization
    @organization = Organization.find_by_id(params[:id])