app/controllers/admin/application_controller.rb

SELECT * FROM `contents` WHERE (`contents`.organization_id = 26) LIMIT 0, 10
SELECT count(*) AS count_all FROM `topics` INNER JOIN `topic_contents` ON `topics`.id = `topic_contents`.topic_id WHERE ((`topic_contents`.content_id = 702))
SELECT featured_content FROM `topics` WHERE (featured_content is not null)
---
  def index
 #   update
    @features = Topic.features
    @active_topics = @current_organization.topics.active
    @pending_topics = @current_organization.topics.pending
    @closed_topics = @current_organization.topics.closed
    @contents = @current_organization.contents.paginate :per_page => 10, :page => params[:page]