app/controllers/admin/application_controller.rb

SELECT * FROM `addresses` WHERE (`addresses`.organization_id = 26) LIMIT 1
---
  def index
    @organization = @current_organization
    @address = @organization.addresses.first || @organization.addresses.new