app/controllers/admin/content_controller.rb

SELECT * FROM `contents` WHERE (`contents`.organization_id = 26) ORDER BY title LIMIT 0, 10
---
  def search
    @features = Topic.features
    if request.xhr?
      @keywords = params[:keywords]
      @contents = (@current_organization.contents.with_keywords @keywords, :organization => @current_organization).paginate :per_page => 10, :page => params[:page]