app/controllers/site/site_controller.rb

  def load_search_fields
    if params[:commit]
      @keywords = params[:prev_keywords]
    else
      @keywords = params[:keywords]
      @filter = "-- No Filter --"
    end
    if @search_type == "People"
      # @search_fields = ["name", "talents", "religious affiliation", "organization"] # HACK for Days of Peace site
      # ALK Put back Organization
      #  @search_fields = ["name", "talents"]
      @search_fields = ["Anything", "Person's Name", "Organization"]
    elsif @search_type == "Organizations"

      @search_fields = ["Name"]
      #
      # ALK change Search Type from "Causes" to "Classrooms"
      #
    elsif @search_type == "Classrooms"
      @search_fields = ["Learning Unit", "Subject Area", "Organization"]
    else
      @search_fields = ["Title/Description", "Subject Area", "Organization"]
      # ALK put back organization as a field
      #@search_fields = ["title or description"]
    end
    @search_field = params[:search_field] || @search_fields.first
---
SELECT * FROM `organizations` WHERE (parent_id AND parent_id = 53 AND organization_type_id =2 AND status_id = 1) ORDER BY name