app/controllers/apps/classroom_controller.rb

  def index
    initialize_parameters
    if !@current_user.classroom_admin_for_org?(@current_organization)
      @teacher = @current_user
      @admin_orgs = []
    else
      @admin_orgs = @current_user.app_admin_orgs(@current_application).select{|o| o != @current_organization}
---
SELECT * FROM `classrooms` WHERE (`classrooms`.organization_id = 27)
SELECT * FROM `coop_apps` WHERE (abbrev = 'CLASSROOM') AND (is_available = 1 ) LIMIT 1

  def offering_options
    initialize_parameters
    if params[:option] == "homework"
      @classroom.update_attributes(:homework_option =>!@classroom.homework_option)
---
UPDATE `classrooms` SET `registration_key` = 'GUVqlCN4', `updated_at` = '2015-10-29 12:47:31' WHERE `id` = 41