app/controllers/fsn_controller.rb

SELECT * FROM `organizations` WHERE (parent_id AND parent_id = 53 AND organization_type_id =2 AND status_id = 1) ORDER BY name
SELECT count(*) AS count_all FROM `organizations`
SELECT count(*) AS count_all FROM `users`
SELECT * FROM `blog_types` WHERE (blog_type = 'OD' ) LIMIT 1
SELECT * FROM `blogs` WHERE (`blogs`.organization_id = 26) AND (((blog_type_id = 3 ) AND (feature = 1)) AND (active = 1)) ORDER BY position LIMIT 1
---
  def index
    initalialize_parameters


    if (Organization.all.empty? && User.all.empty?)
      redirect_to :controller=>"/organizations", :action => :register
    else
      @blog = Blog.find_by_public_id(params[:blog_id]) rescue nil
      if @blog.nil?
        blog_type = BlogType.of_type("OD").first
        @blog = @current_organization.blogs.active.featured.of_type(blog_type).first