app/controllers/users_controller.rb

  def register
    if request.get?
      @user = User.new
    else


      @user = User.new params[:user]

        if User.find_by_email_address(@user.email_address).nil?
          @user.verification_code = User::generate_password(16)
          @user.set_default_registration_values(@current_organization.id)

          if true #simple_captcha_valid?
            if @user.save
     #  Initialize First User as Superuser
              if User.all.size == 1
                @user.make_superuser!
              end

            @user.add_as_friend_to(@user.organization)
            #   temp omit Notifier.deliver_user_registration(:user => @user,:current_organization => @current_organization, :fsn_host => request.host_with_port)
            #            Notifier.deliver_user_registration @user, @current_organization, request.host_with_port
            #            Notifier.deliver_user_activate @user , url_for(:action => "activate" , :email => @user.email_address)

            if @user.organization.register_notify?
              @user.organization.administrators.each do |adm|
---
SELECT * FROM `users` WHERE (`users`.`email_address` = 'third@superuser_not') LIMIT 1
INSERT INTO `users` (`status_id`, `picture_content_type`, `home_org_id`, `is_student`, `is_suspended`, `last_name`, `phone`, `date_of_birth`, `personal_url`, `created_at`, `website_referred_as`, `calibrated_only`, `first_name`, `read_tos`, `country`, `philosophy`, `std_view`, `updated_at`, `email_address`, `picture_file_name`, `preferred_email`, `act_master_id`, `verification_code`, `crypted_password`, `password`, `salt`, `picture_file_size`, `state_province`, `credentials`, `religious_affiliation_id`, `postal_code`, `verified_at`, `alt_phone`, `display_name`, `picture_updated_at`, `city`, `Phone_for_Texting`, `alt_login`, `last_logon`, `other_denomination`, `age_verified`, `display_emai_and_phone`, `Provider_of_Texting_Service`, `organization_id`) VALUES(NULL, NULL, 79, NULL, 0, 'SuperuserNot', NULL, NULL, NULL, '2015-10-29 17:04:28', NULL, 0, 'Third', 1, 'US', NULL, NULL, '2015-10-29 17:04:28', 'third@superusernot.com', NULL, 'third@superusernot.com', 1, 'mAe2WtYasOasNng8', '660903ebd15267c73e0aaba24032e61724b98959', '', 'hGJw6qsLrt', NULL, NULL, NULL, NULL, NULL, '2015-10-29 06:00:00', NULL, NULL, NULL, NULL, NULL, '', NULL, NULL, 1, 1, 'No Texting Wanted', 79)
SELECT * FROM `users`
SELECT * FROM `organizations` WHERE (`organizations`.`id` = 79)

  def logout
    return_org = @current_organization
   unless self.current_user.nil?
     unless     self.current_user.home_org_id.nil?
         home_org = Organization.find_by_id(@current_user.home_org_id)
---
SELECT * FROM `organizations` WHERE (`organizations`.`id` = 1) LIMIT 1